# Find Unique Values in Pandas Dataframes

In [1]:
import pandas as pd
import numpy as np

In [2]:
raw_data = {'regiment': ['51st', '29th', '2nd', '19th', '12th', '101st', '90th', '30th', '193th', '1st', '94th', '91th'], 
            'trucks': ['MAZ-7310', np.nan, 'MAZ-7310', 'MAZ-7310', 'Tatra 810', 'Tatra 810', 'Tatra 810', 'Tatra 810', 'ZIS-150', 'Tatra 810', 'ZIS-150', 'ZIS-150'],
            'tanks': ['Merkava Mark 4', 'Merkava Mark 4', 'Merkava Mark 4', 'Leopard 2A6M', 'Leopard 2A6M', 'Leopard 2A6M', 'Arjun MBT', 'Leopard 2A6M', 'Arjun MBT', 'Arjun MBT', 'Arjun MBT', 'Arjun MBT'],
            'aircraft': ['none', 'none', 'none', 'Harbin Z-9', 'Harbin Z-9', 'none', 'Harbin Z-9', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk']}
df = pd.DataFrame(raw_data, columns = ['regiment', 'trucks', 'tanks', 'aircraft'])

In [3]:
# View the top few rows
df.head()

  regiment     trucks           tanks    aircraft
0     51st   MAZ-7310  Merkava Mark 4        none
1     29th        NaN  Merkava Mark 4        none
2      2nd   MAZ-7310  Merkava Mark 4        none
3     19th   MAZ-7310    Leopard 2A6M  Harbin Z-9
4     12th  Tatra 810    Leopard 2A6M  Harbin Z-9

In [5]:
# Create a list of unique values by turning the pandas column in a set
list(set(df.trucks))

[nan, 'MAZ-7310', 'ZIS-150', 'Tatra 810']

In [8]:
# Create a list of unique values in df.trucks
list(df['trucks'].unique())

['MAZ-7310', nan, 'Tatra 810', 'ZIS-150']

Source: https://chrisalbon.com/python/pandas_find_unique_values.html